#створити 4 змінні и виконати 4 математичні операції
print('Завдання 1: створити 4 змінні и виконати 4 математичні операції')
print('Будь ласка, задайте A')
A = int(input())
print('Будь ласка, задайте B')
B = int(input())
print('Будь ласка, задайте C')
C = int(input())
print('Будь ласка, задайте D')
D = int(input())
E = A+B+C+D
F = A**B**(1/C)*D
G = A*B/(C*D)
H = A//B-(C % D)
print('A+B+C+D =', E)
print('A^B^(1/C)*D =', F)
print('A*B/(C*D) =', G)
print('Ціле від (A/B) мінус Остача від (C/D) =', H)
#конкатенація стрічок
print('Завдання 2: Конкатенація стрічок')
print("Будь ласка, вкажіть Ваше ім'я")
a = input()
print ('Будь ласка, вкажіть Ваше прізвище')
b = input()
c = a + ' ' + b + '.'
print ("Вас звати ", c)
#список з десяти елементів
print('Завдання 3: Список з десяти елементів')
import random
X = list(range(0,10))
print('Задайте нижню межу діапазону чисел у списку')
L = int(input())
print('Задайте верхню межу діапазону чисел у списку')
H = int(input())
i=0
while i <= 9:
    X[i] = random.randint(L, H)
    i = i+1
print('Список X з 10 випадкових елементів:', X)
Y = list(X)
del Y[-1]
print('Список X без 10-го елемента:', Y)