#Создать цикл, который будет делать следующую операцию:
#До тех пор, пока А меньше Б, прибавлять к А В и сравнивать с Б.
#Если после прибавления, А все еще меньше Б - повторить предыдущее действие.
#Результат каждого сравнения должен выводиться в консоль в формате "Значение А" + "Пока что нет".
#В момент, когда А станет больше Б - вывести "Дождались!" + "Финальный А"
print('Завдання "Збільшення А до значення, не меншого за B"')
print('Будь ласка, задайте число A:')
A = float(input())
print('Будь ласка, задайте число B:')
B = float(input())
if A > B:
    print('Задане Вами А =', A, 'і відразу є більшим за В, додаткові операції не потрібні!')
elif A == B:
    print('Задане Вами А =', A, 'і є рівним (не меншим) В, додаткові операції не потрібні!')
else:
    print('Будь ласка, задайте число C, більше нуля:')
    C = float(input())
    while C <= 0:
        print('Будь ласка, задайте число C, більше нуля:')
        C = float(input())
    print('Дякую!')
    print('Задане Вами А =', A, 'і наразі менше від В, збільшуємо його на С.')
    A = A + C
    while A < B:
        print('Проміжний результат: нове значення А =', A, 'і є все ще меншим від В, тому знову збільшуємо його на С.')
        A = A + C
    print('Нарешті! Нове значення А =', A, 'і вже не є меншим за B. Вітаю!')
